RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/lpi2c/fsl_lpi2c.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_lpi2c.h"
#include <stdlib.h>
#include <string.h>

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.lpi2c"
#endif

/* ! @brief LPI2C master fifo commands. */
enum
{
    kTxDataCmd = LPI2C_MTDR_CMD(0x0U), /*!< Transmit DATA[7:0] */
    kRxDataCmd = LPI2C_MTDR_CMD(0X1U), /*!< Receive (DATA[7:0] + 1) bytes */
    kStopCmd   = LPI2C_MTDR_CMD(0x2U), /*!< Generate STOP condition */
    kStartCmd  = LPI2C_MTDR_CMD(0x4U), /*!< Generate(repeated) START and transmit address in DATA[[7:0] */
};

/*!
 * @brief Default watermark values.
 *
 * The default watermarks are set to zero.
 */
enum
{
    kDefaultTxWatermark = 0,
    kDefaultRxWatermark = 0,
};

/*! @brief States for the state machine used by transactional APIs. */
enum
{
    kIdleState = 0,
    kSendCommandState,
    kIssueReadCommandState,
    kTransferDataState,
    kStopState,
    kWaitForCompletionState,
};

/*
 * <! Structure definition for variables that passed as parameters in LPI2C_RunTransferStateMachine.
 * The structure is private.
 */
typedef struct _lpi2c_state_machine_param
{
    bool state_complete;
    size_t rxCount;
    size_t txCount;
    uint32_t status;
} lpi2c_state_machine_param_t;

/*! @brief Typedef for slave interrupt handler. */
typedef void (*lpi2c_slave_isr_t)(LPI2C_Type *base, lpi2c_slave_handle_t *handle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static uint32_t LPI2C_GetCyclesForWidth(
    uint32_t sourceClock_Hz, uint32_t width_ns, uint32_t minCycles, uint32_t maxCycles, uint32_t prescaler);

static status_t LPI2C_MasterWaitForTxReady(LPI2C_Type *base);

static status_t LPI2C_RunTransferStateMachine(LPI2C_Type *base, lpi2c_master_handle_t *handle, bool *isDone);

static void LPI2C_InitTransferStateMachine(lpi2c_master_handle_t *handle);

static status_t LPI2C_SlaveCheckAndClearError(LPI2C_Type *base, uint32_t flags);

static void LPI2C_CommonIRQHandler(LPI2C_Type *base, uint32_t instance);

/*!
 * @brief introduce function LPI2C_TransferStateMachineSendCommandState.
 * This function was deal with Send Command State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param variable_set Pass the address of the parent function variable.
 */
static void LPI2C_TransferStateMachineSendCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams);

/*!
 * @brief introduce function LPI2C_TransferStateMachineIssueReadCommandState.
 * This function was deal with Issue Read Command State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 */
static void LPI2C_TransferStateMachineReadCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams);

/*!
 * @brief introduce function LPI2C_TransferStateMachineTransferDataState.
 * This function was deal with init Transfer Data State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 */
static void LPI2C_TransferStateMachineTransferData(LPI2C_Type *base,
                                                   lpi2c_master_handle_t *handle,
                                                   lpi2c_state_machine_param_t *stateParams);

/*!
 * @brief introduce function LPI2C_TransferStateMachineStopState.
 * This function was deal with Stop State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 * @param[out] isDone Set to true if the transfer has completed.
 */
static void LPI2C_TransferStateMachineStopState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone);

/*!
 * @brief introduce function LPI2C_TransferStateMachineWaitState.
 * This function was deal with Wait For Completion State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 * @param[out] isDone Set to true if the transfer has completed.
 */
static void LPI2C_TransferStateMachineWaitState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Array to map LPI2C instance number to base pointer. */
static LPI2C_Type *const kLpi2cBases[] = LPI2C_BASE_PTRS;

/*! @brief Array to map LPI2C instance number to IRQ number, used internally for LPI2C master interrupt and EDMA
transactional APIs. */
IRQn_Type const kLpi2cIrqs[] = LPI2C_IRQS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Array to map LPI2C instance number to clock gate enum. */
static clock_ip_name_t const kLpi2cClocks[] = LPI2C_CLOCKS;

#if defined(LPI2C_PERIPH_CLOCKS)
/*! @brief Array to map LPI2C instance number to pheripheral clock gate enum. */
static const clock_ip_name_t kLpi2cPeriphClocks[] = LPI2C_PERIPH_CLOCKS;
#endif

#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! @brief Pointer to master IRQ handler for each instance, used internally for LPI2C master interrupt and EDMA
transactional APIs. */
lpi2c_master_isr_t s_lpi2cMasterIsr;

/*! @brief Pointers to master handles for each instance, used internally for LPI2C master interrupt and EDMA
transactional APIs. */
void *s_lpi2cMasterHandle[ARRAY_SIZE(kLpi2cBases)];

/*! @brief Pointer to slave IRQ handler for each instance. */
static lpi2c_slave_isr_t s_lpi2cSlaveIsr;

/*! @brief Pointers to slave handles for each instance. */
static lpi2c_slave_handle_t *s_lpi2cSlaveHandle[ARRAY_SIZE(kLpi2cBases)];

