RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/lpi2c/fsl_lpi2c.c
        /* Read byte from fifo. */
        *(handle->buf)++ = (uint8_t)(base->MRDR & LPI2C_MRDR_DATA_MASK);
    }

    /* Move to stop when the transfer is done. */
    if (--handle->remainingBytes == 0U)
    {
        if (handle->transfer.direction == kLPI2C_Write)
        {
            stateParams->state_complete = true;
        }
        handle->state = (uint8_t)kStopState;
    }
}

static void LPI2C_TransferStateMachineStopState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone)
{
    assert(stateParams != NULL);

    /* Only issue a stop transition if the caller requested it. */
    if ((handle->transfer.flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
    {
        /* Make sure there is room in the tx fifo for the stop command. */
        if (0U == (stateParams->txCount)--)
        {
            stateParams->state_complete = true;
            return;
        }

        base->MTDR = (uint32_t)kStopCmd;
    }
    else
    {
        /* If all data is read and no stop flag is required to send, we are done. */
        if (handle->transfer.direction == kLPI2C_Read)
        {
            *isDone = true;
        }
        stateParams->state_complete = true;
    }
    handle->state = (uint8_t)kWaitForCompletionState;
}

static void LPI2C_TransferStateMachineWaitState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone)
{
    assert(stateParams != NULL);

    if ((handle->transfer.flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
    {
        /* We stay in this state until the stop state is detected. */
        if (0U != ((stateParams->status) & (uint32_t)kLPI2C_MasterStopDetectFlag))
        {
            *isDone = true;
        }
    }
    else
    {
        /* If all data is pushed to FIFO and no stop flag is required to send, we need to make sure they
            are all send out to bus. */
        if ((handle->transfer.direction == kLPI2C_Write) && ((base->MFSR & LPI2C_MFSR_TXCOUNT_MASK) == 0U))
        {
            /* We stay in this state until the data is sent out to bus. */
            *isDone = true;
        }
    }
    stateParams->state_complete = true;
}

/*!
 * @brief Execute states until FIFOs are exhausted.
 * @param handle Master nonblocking driver handle.
 * @param[out] isDone Set to true if the transfer has completed.
 * @retval #kStatus_Success
 * @retval #kStatus_LPI2C_PinLowTimeout
 * @retval #kStatus_LPI2C_ArbitrationLost
 * @retval #kStatus_LPI2C_Nak
 * @retval #kStatus_LPI2C_FifoError
 */
static status_t LPI2C_RunTransferStateMachine(LPI2C_Type *base, lpi2c_master_handle_t *handle, bool *isDone)
{
    assert(NULL != base && NULL != handle && NULL != isDone);

    status_t result = kStatus_Success;
    lpi2c_state_machine_param_t stateParams;
    (void)memset(&stateParams, 0, sizeof(stateParams));

    stateParams.state_complete = false;

    /* Set default isDone return value. */
    *isDone = false;

    /* Check for errors. */
    stateParams.status = LPI2C_MasterGetStatusFlags(base);

    /* Get fifo counts. */
    LPI2C_MasterGetFifoCounts(base, &stateParams.rxCount, &stateParams.txCount);

    /* For the last byte, nack flag is expected.
       Do not check and clear kLPI2C_MasterNackDetectFlag for the last byte,
       in case FIFO is emptied when stop command has not been sent. */
    if (handle->remainingBytes == 0U)
    {
        /* When data size is not zero which means it is not only one byte of address is sent, and */
        /* when the txfifo is empty, or have one byte which is the stop command, then the nack status can be ignored. */
        if (((handle->transfer).dataSize != 0U) &&
            ((stateParams.txCount == 0U) ||
             (((stateParams.txCount) == 1U) && (handle->state == (uint8_t)kWaitForCompletionState) &&
              (((handle->transfer).flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U))))
        {
            (stateParams.status) &= ~(uint32_t)kLPI2C_MasterNackDetectFlag;
        }
    }

    result = LPI2C_MasterCheckAndClearError(base, stateParams.status);

    if (kStatus_Success == result)
    {
        /* Compute room in tx fifo */
        stateParams.txCount = (size_t)FSL_FEATURE_LPI2C_FIFO_SIZEn(base) - stateParams.txCount;

        while (!stateParams.state_complete)
        {
            /* Execute the state. */
            switch (handle->state)
            {
                case (uint8_t)kSendCommandState:
                    LPI2C_TransferStateMachineSendCommand(base, handle, &stateParams);
                    break;

                case (uint8_t)kIssueReadCommandState:
                    LPI2C_TransferStateMachineReadCommand(base, handle, &stateParams);
                    break;

                case (uint8_t)kTransferDataState:
                    LPI2C_TransferStateMachineTransferData(base, handle, &stateParams);
                    break;

                case (uint8_t)kStopState:
                    LPI2C_TransferStateMachineStopState(base, handle, &stateParams, isDone);
                    break;

                case (uint8_t)kWaitForCompletionState:
                    LPI2C_TransferStateMachineWaitState(base, handle, &stateParams, isDone);
                    break;
                default:
                    assert(false);
                    break;
            }
        }
    }
    return result;
}

/*!
 * @brief Prepares the transfer state machine and fills in the command buffer.
 * @param handle Master nonblocking driver handle.
 */
static void LPI2C_InitTransferStateMachine(lpi2c_master_handle_t *handle)
{
    lpi2c_master_transfer_t *xfer = &handle->transfer;

    /* Handle no start option. */
    if (0U != (xfer->flags & (uint32_t)kLPI2C_TransferNoStartFlag))
    {
        if (xfer->direction == kLPI2C_Read)
        {
            /* Need to issue read command first. */
            handle->state = (uint8_t)kIssueReadCommandState;
        }
        else
        {
            /* Start immediately in the data transfer state. */
            handle->state = (uint8_t)kTransferDataState;
        }

        handle->buf            = (uint8_t *)xfer->data;
        handle->remainingBytes = (uint16_t)xfer->dataSize;
    }
    else
    {
        uint16_t *cmd     = (uint16_t *)&handle->commandBuffer;
        uint32_t cmdCount = 0U;

